{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_1", "init": "glorot_uniform", "bias": true, "trainable": true, "nb_row": 5, "nb_filter": 24, "activation": "relu", "subsample": [2, 2], "W_regularizer": null, "input_dtype": "float32", "b_constraint": null, "batch_input_shape": [null, 60, 320, 3], "border_mode": "same", "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_2", "init": "glorot_uniform", "bias": true, "trainable": true, "nb_row": 5, "nb_filter": 36, "activation": "relu", "subsample": [2, 2], "W_regularizer": null, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_3", "init": "glorot_uniform", "bias": true, "trainable": true, "nb_row": 5, "nb_filter": 48, "activation": "relu", "subsample": [2, 2], "W_regularizer": null, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_4", "init": "glorot_uniform", "bias": true, "trainable": true, "nb_row": 3, "nb_filter": 64, "activation": "relu", "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_5", "init": "glorot_uniform", "bias": true, "trainable": true, "nb_row": 3, "nb_filter": 64, "activation": "relu", "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "nb_col": 3}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": 20480, "output_dim": 1164, "init": "glorot_uniform", "trainable": true, "activation": "relu", "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": 1164, "output_dim": 100, "init": "glorot_uniform", "trainable": true, "activation": "relu", "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": 100, "output_dim": 50, "init": "glorot_uniform", "trainable": true, "activation": "relu", "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": 50, "output_dim": 10, "init": "glorot_uniform", "trainable": true, "activation": "relu", "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": 10, "output_dim": 1, "init": "glorot_uniform", "trainable": true, "activation": "linear", "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null}}]}